In [2]:
import sklearn
from matplotlib import pyplot as plt
import pandas as pd
import numpy as np

In [3]:
data=pd.read_csv("hiring.csv")

In [4]:
data

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [5]:
 data.isnull().any(axis=1)

0     True
1     True
2    False
3    False
4    False
5    False
6     True
7    False
dtype: bool

In [6]:

data["experience"].fillna("zero", inplace = True)

data

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [7]:
data.isnull().any(axis=0)

experience                    False
test_score(out of 10)          True
interview_score(out of 10)    False
salary($)                     False
dtype: bool

In [8]:
m=data["test_score(out of 10)"].mean()
data["test_score(out of 10)"].fillna(m,inplace=True)
data

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero               8.000000                           9      50000
1       zero               8.000000                           6      45000
2       five               6.000000                           7      60000
3        two              10.000000                          10      65000
4      seven               9.000000                           6      70000
5      three               7.000000                          10      62000
6        ten               7.857143                           7      72000
7     eleven               7.000000                           8      80000

In [9]:
pip install word2number
# keyword used to download machine learning libraries

SyntaxError: invalid syntax (Temp/ipykernel_8004/3256041022.py, line 1)

In [10]:
# covert word to numver
from word2number import w2n

In [11]:
w2n.word_to_num("five thousand")

5000

In [12]:
data["experience"]=data["experience"].map(w2n.word_to_num)
data

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0               8.000000                           9      50000
1           0               8.000000                           6      45000
2           5               6.000000                           7      60000
3           2              10.000000                          10      65000
4           7               9.000000                           6      70000
5           3               7.000000                          10      62000
6          10               7.857143                           7      72000
7          11               7.000000                           8      80000

In [13]:
x=data[["experience","test_score(out of 10)","interview_score(out of 10)"]]
y=data[["salary($)"]]

In [14]:
from sklearn.linear_model import LinearRegression

In [15]:
model=LinearRegression()

In [16]:
model.fit(x,y)

LinearRegression()

In [17]:
model.predict([[3,7,10]])

array([[61080.55179794]])

In [18]:
model.score(x,y)

0.9639958361860579